import pandas as pd

# 讀取數據
df = pd.read_csv('nasa.csv')

# 列出5筆
print(df.head)

# <bound method NDFrame.head of       Neo Reference ID     Name  Absolute Magnitude  ...  Mean Motion  Equinox  Hazardous
# 0              3703080  3703080              21.600  ...     0.590551    J2000       True
# 1              3723955  3723955              21.300  ...     0.845330    J2000      False
# 2              2446862  2446862              20.300  ...     0.559371    J2000       True
# 3              3092506  3092506              27.400  ...     0.700277    J2000      False
# 4              3514799  3514799              21.600  ...     0.726395    J2000       True
# ...                ...      ...                 ...  ...          ...      ...        ...
# 4682           3759007  3759007              23.900  ...     0.787436    J2000      False
# 4683           3759295  3759295              28.200  ...     0.884117    J2000      False
# 4684           3759714  3759714              22.700  ...     0.521698    J2000      False
# 4685           3759720  3759720              21.800  ...     0.543767    J2000      False
# 4686           3772978  3772978              19.109  ...     0.550729    J2000      False